# Текст на форме ввода

# Текст вкладки выбора по номеру
pr_base_tel_tab = 'Телефон'
# Текст в поле ввода номера при выборе по номеру
pr_base_tel = 'Мобильный телефон'
# Текст вкладки выбора по почте
pr_base_email_tab = 'Почта'
# Текст в поле ввода почты при выборе по почте
pr_base_email = 'Электронная почта'
# Текст вкладки выбора по почте
pr_base_login_tab = 'Логин'
# Текст в поле ввода логина при выборе по логину
pr_base_login = 'Логин'
# Текст вкладки выбора по счету
pr_base_ls_tab = 'Лицевой счёт'
# Текст в поле ввода счета при выборе по счету
pr_base_ls = 'Лицевой счёт'


# Страница авторизации

# Текст в основном заголовке
pauth_h1 = 'Авторизация'
# Валидная почта
v_email = 'testmail@testmail.ru'
# Валидный логин
v_login = 'testlogin'
# Валидный пароль
v_pass = 'SSSsss12'


# Страница регистрации

# Текст в основном заголовке
preg_h1 = 'Регистрация'
# Текст в основном заголовке
preg_in_val = '5200048'
# Текст в заголовке первого абзаца пользовательского соглашения
preg_po = 'Общие положения'
# Текст ошибки неверного заполнения полей "Имя", "Фамилия"
preg_err_name = 'Необходимо заполнить поле кириллицей. От 2 до 30 символов.'
# Текст ошибки неверного заполнения поля "E-mail"
preg_err_email = 'Введите телефон в формате +7ХХХХХХХХХХ или +375XXXXXXXXX, или email в формате example@email.ru'
# Текст ошибки неверного заполнения поля "Пароль"
preg_err_pass = 'Длина пароля должна быть не менее 8 символов'
# Текст ошибки проверки совпадения паролей
preg_err_pass_sr = 'Пароли не совпадают'


# Страница восстановление пароля

# Текст в основном заголовке
pr_h1 = 'Восстановление пароля'
# Текст в поле ввода капчи
pr_captha = 'Капча'
# Текст на кнопке "Продолжить" при выборе способа восстановления по номеру
pr_btn_res_tel = 'По SMS на номер телефона'
# Текст на кнопке "Продолжить" при выборе способа восстановления по почте
pr_btn_res_email = 'По ссылке на почту'


# Личный кабинет

# Текст в основном заголовке
lk_h3 = 'Учетные данные'
